import React from "react";
import styles from "./Skills.module.scss";
import Card from "../../common/Card/Card";
import {
  BiLogoJavascript,
  BiLogoTypescript,
  BiLogoReact,
  BiLogoPython,
  BiLogoGit,
  BiLogoFlutter,
  BiLogoFigma,
} from "react-icons/bi";
import finalCutProLogo from "@/public/images/finalCutProLogo.png";
import Image from "next/image";

interface skillsProps {
  scrollPosition: number;
  screenVh: number;
}

export default function Skills({ scrollPosition, screenVh }: skillsProps) {
  return (
    <section className={styles.background}>
      <h3>Skills</h3>
      <div className={styles.container}>
        <div className={styles.grid}>
          <Card width="66.6%" height="320px" className={styles.js}>
            <>
              <div>
                <BiLogoJavascript />
                <BiLogoTypescript />
              </div>
              <p>
                실행 컨택스트 등 자바스크립트의 동작 원리와 개념을 이해하고,
                프로젝트를 진행할 수 있습니다. 자바스크립트를 이용한 소프트웨어
                문제 해결 능력을 가지고 있습니다.
              </p>
              <div>
                <h4>JavaScript</h4>
                <h5>TypeScript</h5>
              </div>
            </>
          </Card>
          <Card width="33.3%" height="320px" className={styles.react}>
            <>
              <BiLogoReact />
              <p>
                Redux, Recoil 상태관리 라이브러리와 CSS-in-JS 라이브러리를
                활용한 프론트엔드 프로젝트를 진행할 수 있습니다.
              </p>
              <div>
                <h4>React</h4>
                <h5>Redux, Recoil, Styled-components...</h5>
              </div>
            </>
          </Card>
        </div>
        <div className={styles.grid}>
          <Card width="25%" height="220px" className={styles.python}>
            <>
              <BiLogoPython />
              <p>
                자료구조와 알고리즘을 이용한 소프트웨어 문제 해결 능력을 가지고
                있습니다.
              </p>
              <h4>Python</h4>
            </>
          </Card>
          <Card width="25%" height="220px" className={styles.git}>
            <>
              <BiLogoGit />
              <p>Git을 이용한 효과적인 협업을 진행할 수 있습니다.</p>
              <h4>Git</h4>
            </>
          </Card>
          <Card width="50%" height="220px" className={styles.flutter}>
            <>
              <BiLogoFlutter />
              <p>iOS, Android 크로스플랫폼 앱 개발 경험을 가지고 있습니다..</p>
              <h4>Flutter</h4>
            </>
          </Card>
        </div>
      </div>
      <div className={styles.etc}>
        <div>
          <div>
            <BiLogoFigma fill="#F24E1E" />
            <span>Figma</span>
          </div>
          <div>
            <svg
              role="img"
              fill="#31A8FF"
              viewBox="0 0 24 24"
              xmlns="http://www.w3.org/2000/svg"
            >
              <title>Adobe Photoshop</title>
              <path d="M9.85 8.42c-.37-.15-.77-.21-1.18-.2-.26 0-.49 0-.68.01-.2-.01-.34 0-.41.01v3.36c.14.01.27.02.39.02h.53c.39 0 .78-.06 1.15-.18.32-.09.6-.28.82-.53.21-.25.31-.59.31-1.03.01-.31-.07-.62-.23-.89-.17-.26-.41-.46-.7-.57zM19.75.3H4.25C1.9.3 0 2.2 0 4.55v14.899c0 2.35 1.9 4.25 4.25 4.25h15.5c2.35 0 4.25-1.9 4.25-4.25V4.55C24 2.2 22.1.3 19.75.3zm-7.391 11.65c-.399.56-.959.98-1.609 1.22-.68.25-1.43.34-2.25.34-.24 0-.4 0-.5-.01s-.24-.01-.43-.01v3.209c.01.07-.04.131-.11.141H5.52c-.08 0-.12-.041-.12-.131V6.42c0-.07.03-.11.1-.11.17 0 .33 0 .56-.01.24-.01.49-.01.76-.02s.56-.01.87-.02c.31-.01.61-.01.91-.01.82 0 1.5.1 2.06.31.5.17.96.45 1.34.82.32.32.57.71.73 1.14.149.42.229.85.229 1.3.001.86-.199 1.57-.6 2.13zm7.091 3.89c-.28.4-.671.709-1.12.891-.49.209-1.09.318-1.811.318-.459 0-.91-.039-1.359-.129-.35-.061-.7-.17-1.02-.32-.07-.039-.121-.109-.111-.189v-1.74c0-.029.011-.07.041-.09.029-.02.06-.01.09.01.39.23.8.391 1.24.49.379.1.779.15 1.18.15.38 0 .65-.051.83-.141.16-.07.27-.24.27-.42 0-.141-.08-.27-.24-.4-.16-.129-.489-.279-.979-.471-.51-.18-.979-.42-1.42-.719-.31-.221-.569-.51-.761-.85-.159-.32-.239-.67-.229-1.021 0-.43.12-.84.341-1.21.25-.4.619-.72 1.049-.92.469-.239 1.059-.349 1.769-.349.41 0 .83.03 1.24.09.3.04.59.12.86.23.039.01.08.05.1.09.01.04.02.08.02.12v1.63c0 .04-.02.08-.05.1-.09.02-.14.02-.18 0-.3-.16-.62-.27-.96-.34-.37-.08-.74-.13-1.12-.13-.2-.01-.41.02-.601.07-.129.03-.24.1-.31.2-.05.08-.08.18-.08.27s.04.18.101.26c.09.11.209.2.34.27.229.12.47.23.709.33.541.18 1.061.43 1.541.73.33.209.6.49.789.83.16.318.24.67.23 1.029.011.471-.129.94-.389 1.331z" />
            </svg>
            <span>Photoshop</span>
          </div>
        </div>
        <div>
          <div>
            <Image
              width={32}
              height={32}
              alt="final Cut Pro Logo"
              src={finalCutProLogo}
            />
            <span>FinalCutPro</span>
          </div>
          <div>
            <svg
              role="img"
              fill="#9999FF"
              viewBox="0 0 24 24"
              xmlns="http://www.w3.org/2000/svg"
            >
              <title>Adobe After Effects</title>
              <path d="M8.54 10.73c-.1-.31-.19-.61-.29-.92s-.19-.6-.27-.89c-.08-.28-.15-.54-.22-.78h-.02c-.09.43-.2.86-.34 1.29-.15.48-.3.98-.46 1.48-.13.51-.29.98-.44 1.4h2.54c-.06-.21-.14-.46-.23-.72-.09-.27-.18-.56-.27-.86zm8.58-.29c-.55-.03-1.07.26-1.33.76-.12.23-.19.47-.22.72h2.109c.26 0 .45 0 .57-.01.08-.01.16-.03.23-.08v-.1c0-.13-.021-.25-.061-.37-.178-.56-.708-.94-1.298-.92zM19.75.3H4.25C1.9.3 0 2.2 0 4.55v14.9c0 2.35 1.9 4.25 4.25 4.25h15.5c2.35 0 4.25-1.9 4.25-4.25V4.55C24 2.2 22.1.3 19.75.3zm-7.04 16.511h-2.09c-.07.01-.14-.041-.16-.11l-.82-2.4H5.92l-.76 2.36c-.02.09-.1.15-.19.14H3.09c-.11 0-.14-.06-.11-.18L6.2 7.39c.03-.1.06-.19.1-.31.04-.21.06-.43.06-.65-.01-.05.03-.1.08-.11h2.59c.07 0 .12.03.13.08l3.65 10.25c.03.11.001.161-.1.161zm7.851-3.991c-.021.189-.031.33-.041.42-.01.07-.069.13-.14.13-.06 0-.17.01-.33.021-.159.02-.35.029-.579.029-.23 0-.471-.04-.73-.04h-3.17c.039.31.14.62.31.89.181.271.431.48.729.601.4.17.841.26 1.281.25.35-.011.699-.04 1.039-.11.311-.039.61-.119.891-.23.05-.039.08-.02.08.08v1.531c0 .039-.01.08-.021.119-.021.03-.04.051-.069.07-.32.14-.65.24-1 .3-.471.09-.94.13-1.42.12-.761 0-1.4-.12-1.92-.35-.49-.211-.921-.541-1.261-.95-.319-.39-.55-.83-.69-1.31-.14-.471-.209-.961-.209-1.461 0-.539.08-1.07.25-1.59.16-.5.41-.96.75-1.37.33-.4.739-.72 1.209-.95.471-.23 1.03-.31 1.67-.31.531-.01 1.06.09 1.55.31.41.18.77.45 1.05.8.26.34.47.72.601 1.14.129.4.189.81.189 1.22 0 .24-.01.45-.019.64z" />
            </svg>
            <span>AfterEffects</span>
          </div>
        </div>
      </div>
    </section>
  );
}
